Tekla Open API Reference for Tekla Structures 2025
AttributeTypeNameEditor.EditValue Method
 Edits the specified object's value using the editor style indicated by the GetEditStyle method.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object EditValue(
	ITypeDescriptorContext context,
	IServiceProvider provider,
	Object value
)
Public Overrides Function EditValue (
	context As ITypeDescriptorContext,
	provider As IServiceProvider,
	value As Object
) As Object
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
 An ITypeDescriptorContext that can be used to gain additional context information.
provider
Type: System.IServiceProvider
An IServiceProvider that the editor can use to obtain services.
value
Type: System.Object
The object to edit.
Return Value
Type: Object
 The new value of the object. If the value of the object has not changed, this should return the same object it was passed.
See Also
Reference
AttributeTypeNameEditor Class
Tekla.Structures.Dialog Namespace